<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/MobileRTC.h</key>
		<data>
		fgtrAYB2cPg9SWEwMaLgEPV52Vw=
		</data>
		<key>Headers/MobileRTCAnnotationService.h</key>
		<data>
		x/tkDnKactdQIZ4a4fEEP2nGViM=
		</data>
		<key>Headers/MobileRTCAudioRawData.h</key>
		<data>
		WSGz89GTwe5CS8L1+e7FISC1SxU=
		</data>
		<key>Headers/MobileRTCAudioRawDataHelper.h</key>
		<data>
		WAO0eHtvFR326Xnywh0CT5ikHJ0=
		</data>
		<key>Headers/MobileRTCAuthService.h</key>
		<data>
		mNKFbWhMB/pu+uXVrMxNcPREvBA=
		</data>
		<key>Headers/MobileRTCBORole.h</key>
		<data>
		otnETYN1bjDq4K5GrY40Xn9rlFs=
		</data>
		<key>Headers/MobileRTCCallCountryCode.h</key>
		<data>
		N2dwHEwo87+nXj6Bzv5pduNQ9Q0=
		</data>
		<key>Headers/MobileRTCConstants.h</key>
		<data>
		2T+L5yD5Zg0Y+ygz80MvO8Hh4Fo=
		</data>
		<key>Headers/MobileRTCDialinCountry.h</key>
		<data>
		Mg9cfPeGLtzYyaXXxaFJ+HX8NjA=
		</data>
		<key>Headers/MobileRTCDirectShareService.h</key>
		<data>
		zwEGPhFdc+fOqK8/sy236KZ99Cs=
		</data>
		<key>Headers/MobileRTCE2EMeetingKey.h</key>
		<data>
		YKAir2YbCHJuEmO4xSpFLb3nkdU=
		</data>
		<key>Headers/MobileRTCInviteHelper.h</key>
		<data>
		DBLm4tkRVMs7WsNfoSEiu3jTcfg=
		</data>
		<key>Headers/MobileRTCMeetingActionItem.h</key>
		<data>
		QR2JRmhzSVp03O8fOI3V8jV+AKU=
		</data>
		<key>Headers/MobileRTCMeetingChat.h</key>
		<data>
		FubsDz3u+ywOrHHsOMjipG8Qk+M=
		</data>
		<key>Headers/MobileRTCMeetingDelegate.h</key>
		<data>
		YF7CKSdi8OkZ9AcceG0rJFxfX9I=
		</data>
		<key>Headers/MobileRTCMeetingService+AppShare.h</key>
		<data>
		zbxmXPAv7SFglYlF/HkErapfD2c=
		</data>
		<key>Headers/MobileRTCMeetingService+Audio.h</key>
		<data>
		4CysBto2cQwQ8ZlmBiaW5pIV4XA=
		</data>
		<key>Headers/MobileRTCMeetingService+BO.h</key>
		<data>
		W5HFDWe+EGdMy3g441uGWAUUMvo=
		</data>
		<key>Headers/MobileRTCMeetingService+Chat.h</key>
		<data>
		C56UFqaprvZaFLBelMHFeDYdMJg=
		</data>
		<key>Headers/MobileRTCMeetingService+Customize.h</key>
		<data>
		ZmWy/dhpjTQ9wzTDyVFy6k1DZnY=
		</data>
		<key>Headers/MobileRTCMeetingService+InMeeting.h</key>
		<data>
		v78rthBjs6gFJ8LaHJz2s1Jnd3g=
		</data>
		<key>Headers/MobileRTCMeetingService+Interpretation.h</key>
		<data>
		aTvU1qI6RLE8luMOICnyNR0c7LI=
		</data>
		<key>Headers/MobileRTCMeetingService+Reaction.h</key>
		<data>
		W9RRxTXvWPw01/wodtQbxe9ABDI=
		</data>
		<key>Headers/MobileRTCMeetingService+User.h</key>
		<data>
		VwwSRJAJ8rVqNse9NuL8fHr8SZE=
		</data>
		<key>Headers/MobileRTCMeetingService+Video.h</key>
		<data>
		QOlVKAvUJ3M2PFXUExYkqQGF/JI=
		</data>
		<key>Headers/MobileRTCMeetingService+VirtualBackground.h</key>
		<data>
		CudnmSqgoSYiO4IEV9J7/DvU74w=
		</data>
		<key>Headers/MobileRTCMeetingService+Webinar.h</key>
		<data>
		vMScSH0xBBLyOvprSWFVrYJLHmo=
		</data>
		<key>Headers/MobileRTCMeetingService.h</key>
		<data>
		2jX7YUlGGMAYrq3Klbtaakz9KrY=
		</data>
		<key>Headers/MobileRTCMeetingSettings.h</key>
		<data>
		p+e9bEml4sIkmyiBJIz+NtaPREM=
		</data>
		<key>Headers/MobileRTCMeetingUserInfo.h</key>
		<data>
		oT31EcQFCxVXXlr9BSniRi4td4Q=
		</data>
		<key>Headers/MobileRTCPreProcessRawData.h</key>
		<data>
		oi9jUGR3QeeOsomp6xHYv1bwPeA=
		</data>
		<key>Headers/MobileRTCPremeetingService.h</key>
		<data>
		QVRBrQgYCp9OaGwezlOfGxxWwNc=
		</data>
		<key>Headers/MobileRTCQAItem.h</key>
		<data>
		HDfGa5uflNsxBO234/XaXO2+7kU=
		</data>
		<key>Headers/MobileRTCRemoteControlService.h</key>
		<data>
		seX48ILvwErW4oD5mHpmP56HUtU=
		</data>
		<key>Headers/MobileRTCRenderer.h</key>
		<data>
		KYQ2thFD6cYbspXV2njGhvxYS94=
		</data>
		<key>Headers/MobileRTCRoomDevice.h</key>
		<data>
		KGV0cLExrkpqWzbdWR4CFtlz4kw=
		</data>
		<key>Headers/MobileRTCSMSService.h</key>
		<data>
		kjXbvfVYzaEFw8T3VT16oIEJ/7M=
		</data>
		<key>Headers/MobileRTCVideoCapabilityItem.h</key>
		<data>
		sbsP5rT1SM0e1o7s+HxMsh5kxsw=
		</data>
		<key>Headers/MobileRTCVideoRawData.h</key>
		<data>
		38Ey//x9V/6gzEmm45zfM87PH2A=
		</data>
		<key>Headers/MobileRTCVideoSender.h</key>
		<data>
		E6R7hzWkWm8p8VRm2cWYVcfNWfk=
		</data>
		<key>Headers/MobileRTCVideoSourceHelper.h</key>
		<data>
		9G3RBhKh6Feb/1J/XqxRmmY4VFo=
		</data>
		<key>Headers/MobileRTCVideoView.h</key>
		<data>
		+4CtDqViocQNhnPOrG18EPLIylU=
		</data>
		<key>Headers/MobileRTCWaitingRoomService.h</key>
		<data>
		O9K+qXLkksUX/E5updh8KKiluWk=
		</data>
		<key>Info.plist</key>
		<data>
		hIlr9Z0kHtOovzA/BTkH4xW/3yQ=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		/ILpsYv0ChkLqhS4kV95brluqKk=
		</data>
		<key>bgr_hori_ipad.mlmodelc/coremldata.bin</key>
		<data>
		hs5YpBgeDJxCKF5vy2SBszUKt68=
		</data>
		<key>bgr_hori_ipad.mlmodelc/model.espresso.net</key>
		<data>
		GIxTZ8QY+lJ7XE/0R/nvnHG1fzw=
		</data>
		<key>bgr_hori_ipad.mlmodelc/model.espresso.shape</key>
		<data>
		MFPOu04J/RPVXsMMDApOu4PGj54=
		</data>
		<key>bgr_hori_ipad.mlmodelc/model.espresso.weights</key>
		<data>
		NAN57lFlHa4uLyNpUA5WbwJP+bY=
		</data>
		<key>bgr_hori_ipad.mlmodelc/model/coremldata.bin</key>
		<data>
		DqFUDOSjuOMPotbZ1G4/2dN+YRE=
		</data>
		<key>bgr_hori_ipad.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
		<key>bgr_hori_iphone.mlmodelc/coremldata.bin</key>
		<data>
		nMjMmw/a/ZtFI432Fnv6an+pjyI=
		</data>
		<key>bgr_hori_iphone.mlmodelc/model.espresso.net</key>
		<data>
		VKVL3X/zmA1+HBTUYPk+9VItq3M=
		</data>
		<key>bgr_hori_iphone.mlmodelc/model.espresso.shape</key>
		<data>
		q9/ipcbuaZQnbYgeVNShDunlbZg=
		</data>
		<key>bgr_hori_iphone.mlmodelc/model.espresso.weights</key>
		<data>
		5lKi3N10gFYDkj1vG0ea07w2H5I=
		</data>
		<key>bgr_hori_iphone.mlmodelc/model/coremldata.bin</key>
		<data>
		DqFUDOSjuOMPotbZ1G4/2dN+YRE=
		</data>
		<key>bgr_hori_iphone.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
		<key>bgr_vert_ipad.mlmodelc/coremldata.bin</key>
		<data>
		hs5YpBgeDJxCKF5vy2SBszUKt68=
		</data>
		<key>bgr_vert_ipad.mlmodelc/model.espresso.net</key>
		<data>
		GIxTZ8QY+lJ7XE/0R/nvnHG1fzw=
		</data>
		<key>bgr_vert_ipad.mlmodelc/model.espresso.shape</key>
		<data>
		MFPOu04J/RPVXsMMDApOu4PGj54=
		</data>
		<key>bgr_vert_ipad.mlmodelc/model.espresso.weights</key>
		<data>
		8jEzw2nkcpwV2Mvd23HOnKn3ses=
		</data>
		<key>bgr_vert_ipad.mlmodelc/model/coremldata.bin</key>
		<data>
		DqFUDOSjuOMPotbZ1G4/2dN+YRE=
		</data>
		<key>bgr_vert_ipad.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
		<key>bgr_vert_iphone.mlmodelc/coremldata.bin</key>
		<data>
		nMjMmw/a/ZtFI432Fnv6an+pjyI=
		</data>
		<key>bgr_vert_iphone.mlmodelc/model.espresso.net</key>
		<data>
		VKVL3X/zmA1+HBTUYPk+9VItq3M=
		</data>
		<key>bgr_vert_iphone.mlmodelc/model.espresso.shape</key>
		<data>
		q9/ipcbuaZQnbYgeVNShDunlbZg=
		</data>
		<key>bgr_vert_iphone.mlmodelc/model.espresso.weights</key>
		<data>
		SbLr3TSNvBTpgI2lMmAzZAJphVg=
		</data>
		<key>bgr_vert_iphone.mlmodelc/model/coremldata.bin</key>
		<data>
		DqFUDOSjuOMPotbZ1G4/2dN+YRE=
		</data>
		<key>bgr_vert_iphone.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
		<key>flm.mlmodelc/coremldata.bin</key>
		<data>
		kQVxmb+iFFZy2zqAgypf21zVLnk=
		</data>
		<key>flm.mlmodelc/model.espresso.net</key>
		<data>
		9NviAn9zq2RkbQaT4Bt+xikpj+I=
		</data>
		<key>flm.mlmodelc/model.espresso.shape</key>
		<data>
		RbCGyLKqiAAd87G6N/knG2c5Q78=
		</data>
		<key>flm.mlmodelc/model.espresso.weights</key>
		<data>
		+kfK59EHRlygxRKaroPpxx6WcDI=
		</data>
		<key>flm.mlmodelc/model/coremldata.bin</key>
		<data>
		sAilHvVxCPam2pSz/l8ae9uYGG4=
		</data>
		<key>flm.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/MobileRTC.h</key>
		<dict>
			<key>hash</key>
			<data>
			fgtrAYB2cPg9SWEwMaLgEPV52Vw=
			</data>
			<key>hash2</key>
			<data>
			QCIiLfV99hhvBJQWfXVzb2GMy7JT2mW6gs6tWGpsNwI=
			</data>
		</dict>
		<key>Headers/MobileRTCAnnotationService.h</key>
		<dict>
			<key>hash</key>
			<data>
			x/tkDnKactdQIZ4a4fEEP2nGViM=
			</data>
			<key>hash2</key>
			<data>
			miJsbt3ASUrnaeJPuuEbjIN7XF4avz8UB1yAm51msEw=
			</data>
		</dict>
		<key>Headers/MobileRTCAudioRawData.h</key>
		<dict>
			<key>hash</key>
			<data>
			WSGz89GTwe5CS8L1+e7FISC1SxU=
			</data>
			<key>hash2</key>
			<data>
			yQz2Yr7eARNbIE7PpsdDHw3e4zKIgJisRRiEgZ6sqaM=
			</data>
		</dict>
		<key>Headers/MobileRTCAudioRawDataHelper.h</key>
		<dict>
			<key>hash</key>
			<data>
			WAO0eHtvFR326Xnywh0CT5ikHJ0=
			</data>
			<key>hash2</key>
			<data>
			wWgEX+J9nK4h/Wqhb1w0pv+aGOx3MipqFPkwa8k2XkU=
			</data>
		</dict>
		<key>Headers/MobileRTCAuthService.h</key>
		<dict>
			<key>hash</key>
			<data>
			mNKFbWhMB/pu+uXVrMxNcPREvBA=
			</data>
			<key>hash2</key>
			<data>
			eu6xcfOXcD0sOCv7hq966OCTqAwOp7IktV+OuCUNwOg=
			</data>
		</dict>
		<key>Headers/MobileRTCBORole.h</key>
		<dict>
			<key>hash</key>
			<data>
			otnETYN1bjDq4K5GrY40Xn9rlFs=
			</data>
			<key>hash2</key>
			<data>
			NkOHXfeDv4CDM2QG0S/uJtq2+XRBuCOOyDtdl8gqv7M=
			</data>
		</dict>
		<key>Headers/MobileRTCCallCountryCode.h</key>
		<dict>
			<key>hash</key>
			<data>
			N2dwHEwo87+nXj6Bzv5pduNQ9Q0=
			</data>
			<key>hash2</key>
			<data>
			pbyQMxWPHKTjKZpDVO6uDgozD0MzrWsUIiOYAaq6elc=
			</data>
		</dict>
		<key>Headers/MobileRTCConstants.h</key>
		<dict>
			<key>hash</key>
			<data>
			2T+L5yD5Zg0Y+ygz80MvO8Hh4Fo=
			</data>
			<key>hash2</key>
			<data>
			AE9kxyBpGxBotcNwLLJe83MyDPvbDBEDI6d+0iV5L7Q=
			</data>
		</dict>
		<key>Headers/MobileRTCDialinCountry.h</key>
		<dict>
			<key>hash</key>
			<data>
			Mg9cfPeGLtzYyaXXxaFJ+HX8NjA=
			</data>
			<key>hash2</key>
			<data>
			/wJThiR9GW7TM4+BXxCx85xPORi9wJBdoue+M2gwoJY=
			</data>
		</dict>
		<key>Headers/MobileRTCDirectShareService.h</key>
		<dict>
			<key>hash</key>
			<data>
			zwEGPhFdc+fOqK8/sy236KZ99Cs=
			</data>
			<key>hash2</key>
			<data>
			wkpi/RuCGJZWGM7CVw1Xj/sUdrZH5hpKUzT9gEIQAXw=
			</data>
		</dict>
		<key>Headers/MobileRTCE2EMeetingKey.h</key>
		<dict>
			<key>hash</key>
			<data>
			YKAir2YbCHJuEmO4xSpFLb3nkdU=
			</data>
			<key>hash2</key>
			<data>
			bT6oDPfNLM+JDjtq+M2uiRnHobhJnLXltUNR+0+biSw=
			</data>
		</dict>
		<key>Headers/MobileRTCInviteHelper.h</key>
		<dict>
			<key>hash</key>
			<data>
			DBLm4tkRVMs7WsNfoSEiu3jTcfg=
			</data>
			<key>hash2</key>
			<data>
			Axf+5pS+vL1LdM2/oobPqTV9SGADjl1y3S8sj169fgM=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingActionItem.h</key>
		<dict>
			<key>hash</key>
			<data>
			QR2JRmhzSVp03O8fOI3V8jV+AKU=
			</data>
			<key>hash2</key>
			<data>
			zqz/hI4T7t6LTAuWAVJV87O9X1q0uFj+p4I001trgGo=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingChat.h</key>
		<dict>
			<key>hash</key>
			<data>
			FubsDz3u+ywOrHHsOMjipG8Qk+M=
			</data>
			<key>hash2</key>
			<data>
			8Ez6FKQTLKlqk8CB3iUogwgoWxtgHw/f+sbLHTIa6DI=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingDelegate.h</key>
		<dict>
			<key>hash</key>
			<data>
			YF7CKSdi8OkZ9AcceG0rJFxfX9I=
			</data>
			<key>hash2</key>
			<data>
			x2foOLdHu0k8ppuFCS25FVyy5jsNbEStohzOfYGvI+g=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+AppShare.h</key>
		<dict>
			<key>hash</key>
			<data>
			zbxmXPAv7SFglYlF/HkErapfD2c=
			</data>
			<key>hash2</key>
			<data>
			PE3wGqZVj/pJqI97sfp0BwLHKXUDu9Tb2AB4h8KIPV0=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+Audio.h</key>
		<dict>
			<key>hash</key>
			<data>
			4CysBto2cQwQ8ZlmBiaW5pIV4XA=
			</data>
			<key>hash2</key>
			<data>
			jZ2BZNPZRc1L4JSbynDfzMFxhItYS5/QrbiBD3xFPB8=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+BO.h</key>
		<dict>
			<key>hash</key>
			<data>
			W5HFDWe+EGdMy3g441uGWAUUMvo=
			</data>
			<key>hash2</key>
			<data>
			AWM3AWA8R/eQkPKklcd86SVVojjjmfu3e7LEpHosl4Y=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+Chat.h</key>
		<dict>
			<key>hash</key>
			<data>
			C56UFqaprvZaFLBelMHFeDYdMJg=
			</data>
			<key>hash2</key>
			<data>
			vsMl+Ja8ckvwn/xeyskiMLH4KMXO1qN0mePzfojuSK8=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+Customize.h</key>
		<dict>
			<key>hash</key>
			<data>
			ZmWy/dhpjTQ9wzTDyVFy6k1DZnY=
			</data>
			<key>hash2</key>
			<data>
			dKj8K121gu0FJvid2bN/3C4wNYo/N4janKCGEHgYd44=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+InMeeting.h</key>
		<dict>
			<key>hash</key>
			<data>
			v78rthBjs6gFJ8LaHJz2s1Jnd3g=
			</data>
			<key>hash2</key>
			<data>
			Xsg0lR49GboNabSMf76alHxHhd8IkXu+w9kQnAIg+YM=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+Interpretation.h</key>
		<dict>
			<key>hash</key>
			<data>
			aTvU1qI6RLE8luMOICnyNR0c7LI=
			</data>
			<key>hash2</key>
			<data>
			HXf8lQO0VByyZ263FJP8U99nfC0ydJVtRVnkJX4mo0g=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+Reaction.h</key>
		<dict>
			<key>hash</key>
			<data>
			W9RRxTXvWPw01/wodtQbxe9ABDI=
			</data>
			<key>hash2</key>
			<data>
			BlWwOvsOpavFY5NRtUxJ3CYqMh0CgOpmnKmxZSz34Lo=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+User.h</key>
		<dict>
			<key>hash</key>
			<data>
			VwwSRJAJ8rVqNse9NuL8fHr8SZE=
			</data>
			<key>hash2</key>
			<data>
			8IeMRmnj1FxxxTUfamoqNcfCbMcVR3LsAGL1l+gYiGM=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+Video.h</key>
		<dict>
			<key>hash</key>
			<data>
			QOlVKAvUJ3M2PFXUExYkqQGF/JI=
			</data>
			<key>hash2</key>
			<data>
			rRqGe+Ov5XpyNJBtjLYL/9CIplxKTpsax4uKnI0XawE=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+VirtualBackground.h</key>
		<dict>
			<key>hash</key>
			<data>
			CudnmSqgoSYiO4IEV9J7/DvU74w=
			</data>
			<key>hash2</key>
			<data>
			guVqQbtr7zaQRaz2HBr/QS0m+taMzKMHwN5tPhCn5TQ=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService+Webinar.h</key>
		<dict>
			<key>hash</key>
			<data>
			vMScSH0xBBLyOvprSWFVrYJLHmo=
			</data>
			<key>hash2</key>
			<data>
			ST7T5dZw1CgozerHCDvZ9E7WlQ6NPqyXKQr5cFfiGws=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingService.h</key>
		<dict>
			<key>hash</key>
			<data>
			2jX7YUlGGMAYrq3Klbtaakz9KrY=
			</data>
			<key>hash2</key>
			<data>
			jBhfTOsXUYcsjoR57HbgyQNAs7REYJVNXrP3zD2LdjM=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingSettings.h</key>
		<dict>
			<key>hash</key>
			<data>
			p+e9bEml4sIkmyiBJIz+NtaPREM=
			</data>
			<key>hash2</key>
			<data>
			waK7Do7ECbI51CE88+sGolH5TTqbNhmeJXBIp29sXE4=
			</data>
		</dict>
		<key>Headers/MobileRTCMeetingUserInfo.h</key>
		<dict>
			<key>hash</key>
			<data>
			oT31EcQFCxVXXlr9BSniRi4td4Q=
			</data>
			<key>hash2</key>
			<data>
			FmUIe3H0z9TxXN/pnyy2cFJ2VaLZyKuGDJ2nu1fRtzs=
			</data>
		</dict>
		<key>Headers/MobileRTCPreProcessRawData.h</key>
		<dict>
			<key>hash</key>
			<data>
			oi9jUGR3QeeOsomp6xHYv1bwPeA=
			</data>
			<key>hash2</key>
			<data>
			i7Vqsjiuj1YBgLgbt7V87vdwPaXIHQTUaMlli6IupnE=
			</data>
		</dict>
		<key>Headers/MobileRTCPremeetingService.h</key>
		<dict>
			<key>hash</key>
			<data>
			QVRBrQgYCp9OaGwezlOfGxxWwNc=
			</data>
			<key>hash2</key>
			<data>
			GDsU+FuIJpcvFw8guFbrfZ/SxetRlkln2m/qTEg5ZMk=
			</data>
		</dict>
		<key>Headers/MobileRTCQAItem.h</key>
		<dict>
			<key>hash</key>
			<data>
			HDfGa5uflNsxBO234/XaXO2+7kU=
			</data>
			<key>hash2</key>
			<data>
			xPJu3su18mCBLrC6kQC5ZDM2tfpYQrU7bpn8yQTNNt0=
			</data>
		</dict>
		<key>Headers/MobileRTCRemoteControlService.h</key>
		<dict>
			<key>hash</key>
			<data>
			seX48ILvwErW4oD5mHpmP56HUtU=
			</data>
			<key>hash2</key>
			<data>
			PkOnN868BTcAWUk4QIzbiEm7mIWfHVjzYGJnzzy80xw=
			</data>
		</dict>
		<key>Headers/MobileRTCRenderer.h</key>
		<dict>
			<key>hash</key>
			<data>
			KYQ2thFD6cYbspXV2njGhvxYS94=
			</data>
			<key>hash2</key>
			<data>
			ggsDrvTnnE4C9McNcRbUGWioUX7wXsravm1260hFe0I=
			</data>
		</dict>
		<key>Headers/MobileRTCRoomDevice.h</key>
		<dict>
			<key>hash</key>
			<data>
			KGV0cLExrkpqWzbdWR4CFtlz4kw=
			</data>
			<key>hash2</key>
			<data>
			E5X6DYGASb1BDGKGVyo40d/H886mTi6OrRqbPdi/E3o=
			</data>
		</dict>
		<key>Headers/MobileRTCSMSService.h</key>
		<dict>
			<key>hash</key>
			<data>
			kjXbvfVYzaEFw8T3VT16oIEJ/7M=
			</data>
			<key>hash2</key>
			<data>
			X4JDHL47L9nSEWc9bC/BWxL8jRgatDp4lY/+2VU8XKQ=
			</data>
		</dict>
		<key>Headers/MobileRTCVideoCapabilityItem.h</key>
		<dict>
			<key>hash</key>
			<data>
			sbsP5rT1SM0e1o7s+HxMsh5kxsw=
			</data>
			<key>hash2</key>
			<data>
			OmLuCnmNGibLZLeS+JIoKlSQF1QP5ayIMDfW383ArBI=
			</data>
		</dict>
		<key>Headers/MobileRTCVideoRawData.h</key>
		<dict>
			<key>hash</key>
			<data>
			38Ey//x9V/6gzEmm45zfM87PH2A=
			</data>
			<key>hash2</key>
			<data>
			acs57qq99P5VH0qwhP7i1OMSQEDMO67UvBLjGnSDuWs=
			</data>
		</dict>
		<key>Headers/MobileRTCVideoSender.h</key>
		<dict>
			<key>hash</key>
			<data>
			E6R7hzWkWm8p8VRm2cWYVcfNWfk=
			</data>
			<key>hash2</key>
			<data>
			TNTYwdRz07sAStjmOZoI7/1xVbjjrrjABc6KDn5HjCQ=
			</data>
		</dict>
		<key>Headers/MobileRTCVideoSourceHelper.h</key>
		<dict>
			<key>hash</key>
			<data>
			9G3RBhKh6Feb/1J/XqxRmmY4VFo=
			</data>
			<key>hash2</key>
			<data>
			W3PIYgC4IUD/81Yhz4uUVoxj8cga2lOQeoDJxhueqrY=
			</data>
		</dict>
		<key>Headers/MobileRTCVideoView.h</key>
		<dict>
			<key>hash</key>
			<data>
			+4CtDqViocQNhnPOrG18EPLIylU=
			</data>
			<key>hash2</key>
			<data>
			/JLpIyIkvnN91MMdaW1GZIEF5PXY5G9/7ilTpJIrd1g=
			</data>
		</dict>
		<key>Headers/MobileRTCWaitingRoomService.h</key>
		<dict>
			<key>hash</key>
			<data>
			O9K+qXLkksUX/E5updh8KKiluWk=
			</data>
			<key>hash2</key>
			<data>
			q/bodTfGmqh04RirKESBPexIETIP+scAlE0ZGjUPiyQ=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash</key>
			<data>
			/ILpsYv0ChkLqhS4kV95brluqKk=
			</data>
			<key>hash2</key>
			<data>
			2n1PDl8H/6Y1jDDAwm11nofAHDekWW6Tv0ChNSKVSbM=
			</data>
		</dict>
		<key>bgr_hori_ipad.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			hs5YpBgeDJxCKF5vy2SBszUKt68=
			</data>
			<key>hash2</key>
			<data>
			/uaKmGDfsRE0UxtFQ/0HYmUsHGS9QS39Dv7uwFAH2qs=
			</data>
		</dict>
		<key>bgr_hori_ipad.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			GIxTZ8QY+lJ7XE/0R/nvnHG1fzw=
			</data>
			<key>hash2</key>
			<data>
			zgH2C9YpGC1mSkvt3M4GJZ/Rnbv/Pkd3x860w0zXtSg=
			</data>
		</dict>
		<key>bgr_hori_ipad.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			MFPOu04J/RPVXsMMDApOu4PGj54=
			</data>
			<key>hash2</key>
			<data>
			yCwr+wJ0M+ICf/Z+Yyw7P0YHVGhYiWwLLgEjwRPZLwI=
			</data>
		</dict>
		<key>bgr_hori_ipad.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			NAN57lFlHa4uLyNpUA5WbwJP+bY=
			</data>
			<key>hash2</key>
			<data>
			v+oKOoUHGWdUPzePToZiqtGZp9Bs54AtoaBwpsp6XtY=
			</data>
		</dict>
		<key>bgr_hori_ipad.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			DqFUDOSjuOMPotbZ1G4/2dN+YRE=
			</data>
			<key>hash2</key>
			<data>
			8fzLGa99BwKgFczvbuCLgGkaZmP3PDoWpZxKcq54XnM=
			</data>
		</dict>
		<key>bgr_hori_ipad.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			3oqEe/+MND1puFOiFebud17y75Y=
			</data>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
		<key>bgr_hori_iphone.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			nMjMmw/a/ZtFI432Fnv6an+pjyI=
			</data>
			<key>hash2</key>
			<data>
			iOb70AoHzwMUZK7Ox8flFSmprLTYVTCkL2lGSDiezQk=
			</data>
		</dict>
		<key>bgr_hori_iphone.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			VKVL3X/zmA1+HBTUYPk+9VItq3M=
			</data>
			<key>hash2</key>
			<data>
			efY2BSJAV44cdwL3EFxtVtg8mwuoy1DxUpKHwjMLnvQ=
			</data>
		</dict>
		<key>bgr_hori_iphone.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			q9/ipcbuaZQnbYgeVNShDunlbZg=
			</data>
			<key>hash2</key>
			<data>
			bC9CDe1sBOZzo5rs1X8bNGhRfEbzNg/nWt7ijI6GSPs=
			</data>
		</dict>
		<key>bgr_hori_iphone.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			5lKi3N10gFYDkj1vG0ea07w2H5I=
			</data>
			<key>hash2</key>
			<data>
			i/l8Ndl4ROM5PfAuA+kbv/qORVWMeM8qh5mAr4Hyu7w=
			</data>
		</dict>
		<key>bgr_hori_iphone.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			DqFUDOSjuOMPotbZ1G4/2dN+YRE=
			</data>
			<key>hash2</key>
			<data>
			8fzLGa99BwKgFczvbuCLgGkaZmP3PDoWpZxKcq54XnM=
			</data>
		</dict>
		<key>bgr_hori_iphone.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			3oqEe/+MND1puFOiFebud17y75Y=
			</data>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
		<key>bgr_vert_ipad.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			hs5YpBgeDJxCKF5vy2SBszUKt68=
			</data>
			<key>hash2</key>
			<data>
			/uaKmGDfsRE0UxtFQ/0HYmUsHGS9QS39Dv7uwFAH2qs=
			</data>
		</dict>
		<key>bgr_vert_ipad.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			GIxTZ8QY+lJ7XE/0R/nvnHG1fzw=
			</data>
			<key>hash2</key>
			<data>
			zgH2C9YpGC1mSkvt3M4GJZ/Rnbv/Pkd3x860w0zXtSg=
			</data>
		</dict>
		<key>bgr_vert_ipad.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			MFPOu04J/RPVXsMMDApOu4PGj54=
			</data>
			<key>hash2</key>
			<data>
			yCwr+wJ0M+ICf/Z+Yyw7P0YHVGhYiWwLLgEjwRPZLwI=
			</data>
		</dict>
		<key>bgr_vert_ipad.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			8jEzw2nkcpwV2Mvd23HOnKn3ses=
			</data>
			<key>hash2</key>
			<data>
			pBufTuPVJZGTllak57LZZ8md9xHbqBfe9T8ylBA36cU=
			</data>
		</dict>
		<key>bgr_vert_ipad.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			DqFUDOSjuOMPotbZ1G4/2dN+YRE=
			</data>
			<key>hash2</key>
			<data>
			8fzLGa99BwKgFczvbuCLgGkaZmP3PDoWpZxKcq54XnM=
			</data>
		</dict>
		<key>bgr_vert_ipad.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			3oqEe/+MND1puFOiFebud17y75Y=
			</data>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
		<key>bgr_vert_iphone.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			nMjMmw/a/ZtFI432Fnv6an+pjyI=
			</data>
			<key>hash2</key>
			<data>
			iOb70AoHzwMUZK7Ox8flFSmprLTYVTCkL2lGSDiezQk=
			</data>
		</dict>
		<key>bgr_vert_iphone.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			VKVL3X/zmA1+HBTUYPk+9VItq3M=
			</data>
			<key>hash2</key>
			<data>
			efY2BSJAV44cdwL3EFxtVtg8mwuoy1DxUpKHwjMLnvQ=
			</data>
		</dict>
		<key>bgr_vert_iphone.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			q9/ipcbuaZQnbYgeVNShDunlbZg=
			</data>
			<key>hash2</key>
			<data>
			bC9CDe1sBOZzo5rs1X8bNGhRfEbzNg/nWt7ijI6GSPs=
			</data>
		</dict>
		<key>bgr_vert_iphone.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			SbLr3TSNvBTpgI2lMmAzZAJphVg=
			</data>
			<key>hash2</key>
			<data>
			zRaXdkciqZI/0z3/Jcozyjsg1tWPqFZo5xQFLXGnTU0=
			</data>
		</dict>
		<key>bgr_vert_iphone.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			DqFUDOSjuOMPotbZ1G4/2dN+YRE=
			</data>
			<key>hash2</key>
			<data>
			8fzLGa99BwKgFczvbuCLgGkaZmP3PDoWpZxKcq54XnM=
			</data>
		</dict>
		<key>bgr_vert_iphone.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			3oqEe/+MND1puFOiFebud17y75Y=
			</data>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
		<key>flm.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			kQVxmb+iFFZy2zqAgypf21zVLnk=
			</data>
			<key>hash2</key>
			<data>
			9Dab8WyOppw9B55kXWD8CQxFyP4jkQ894QIQQweIKbA=
			</data>
		</dict>
		<key>flm.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			9NviAn9zq2RkbQaT4Bt+xikpj+I=
			</data>
			<key>hash2</key>
			<data>
			tYZZ16AiKJaH2kg8Rc63objnx59vnFd9AOIdpQayqTo=
			</data>
		</dict>
		<key>flm.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			RbCGyLKqiAAd87G6N/knG2c5Q78=
			</data>
			<key>hash2</key>
			<data>
			NMwGXuKVGhjtmJPXk/QYWdKnfaYbjG/NMvsWDjRC/MA=
			</data>
		</dict>
		<key>flm.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			+kfK59EHRlygxRKaroPpxx6WcDI=
			</data>
			<key>hash2</key>
			<data>
			JHkZVeBAPgDYpDen0s7G6wOi/+s7bvIOFqNH9eGPTTA=
			</data>
		</dict>
		<key>flm.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			sAilHvVxCPam2pSz/l8ae9uYGG4=
			</data>
			<key>hash2</key>
			<data>
			UVkIvdgrGVUYi/wprJkauBSI5CsljIVSHFvZVZacuTs=
			</data>
		</dict>
		<key>flm.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			3oqEe/+MND1puFOiFebud17y75Y=
			</data>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
